//-----------------------------------------------------------------
// 程序描述:
//     帧控制
// 作    者:
// 开始日期: 2022-12-28
// 完成日期: 2022-12-28
// 修改日期: 2022-12-28
// 当前版本: V1.0.1
// 历史版本:
//  - V1.0: (2014-02-07)帧控制
// - V1.0.1:(2014-02-16)头文件中不包含其他头文件
// 调试工具: 凌智STM32核心开发板、LZE_ST_LINK2
// 说    明:
//
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "GPIO_Init_Configuration.h"
#include "control.h"
#include "Delay.h"

//引脚定义
/*
U/D:    PC0 PC1 控制方式
INC:    PC2 PC3 下边沿触发
CS:     PC4 PC5 控制开关，低电平有效
*/

void UP_024(void)
{
    PC4_OFF;
    PC0_OFF;
    PC2_ON;

    PC2_OFF; //下边沿触发
    PC4_ON;

}

void DOWN_024(void)
{
    PC4_OFF;
    PC0_ON;
    PC2_ON;

    PC2_OFF;//下边沿触发
    PC4_ON;

}

void UP_135(void)
{
    PC5_OFF;
    PC1_OFF;
    PC3_ON;

    PC3_OFF;//下边沿触发
    PC5_ON;

}

void DOWN_135(void)
{
    PC5_OFF;
    PC1_ON;
    PC3_ON;

    PC3_OFF;//下边沿触发
    PC5_ON;

}

//-----------------------------------------------------------------
