//-----------------------------------------------------------------
// 程序描述:
//    USB虚拟串口
// 作    者: wlx
// 开始日期: 2022-03-06
// 完成日期: 2022-03-06
// 修改日期: 2022-03-06
// 版    本: V1.0
// 调试工具: 凌智STM32核心开发板、LZE_ST LINK2
//           2.8寸液晶、串口调试小助手
// 说    明:
//    - 调试使用的系统时钟频率Fsysclk=72MHz；
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include <stdio.h>
#include "Delay.h"
#include "usb_lib.h"
#include "usb_desc.h"
#include "hw_config.h"
#include "usb_pwr.h"
#include "PeripheralInit.h"
#include "GPIO_Init_Configuration.h"
#include "control.h"

//-----------------------------------------------------------------
// 全局变量
//-----------------------------------------------------------------
// 接收成功标志
extern u8 Resive_Flag;
extern u16 Resive_Num;
// 接收缓冲
extern uint8_t USB_Rx_Buffer[VIRTUAL_COM_PORT_DATA_SIZE];

//-----------------------------------------------------------------
// void USB_Send_string(u8* data_buffer)
//-----------------------------------------------------------------
//
// 函数功能:  USB发送字符串
// 入口参数:  发送字符串首地址
// 返 回 值:  无
// 注意事项:
//-----------------------------------------------------------------

void USB_Send_string(u8 *data_buffer, u8 N)
{
  if (N > 63)
  {
    N = 63;
  }
  // 拷贝用户数据到端点1的发送缓冲区
  UserToPMABufferCopy(data_buffer, ENDP1_TXADDR, N);
  // 设置端点1发送数据长度
  SetEPTxCount(ENDP1, N);
  // 设置端点1的发送状态为Valid
  SetEPTxValid(ENDP1);
}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------

int main(void)
{
    // 外设初始化
  PeripheralInit();
  while (1)
  {
    //通过中断执行接收以及电位器的控制
  }
}
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
