//-----------------------------------------------------------------
// 程序描述:
// 　　芯片外设初始化
// 作　　者: 凌智电子
// 开始日期: 2014-02-21
// 完成日期: 2014-02-21
// 修改日期:
// 版　　本: V1.0
// 　- V1.0: STM32F103VCT6外设初始化
// 调试工具: 凌智STM32+FPGA电子系统设计开发板、2.8寸液晶屏、
//            LZE_ST_LINK2
// 说　　明:
//
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "PeripheralInit.h"
#include "usb_lib.h"
#include "usb_desc.h"
#include "hw_config.h"
#include "usb_pwr.h"
#include "Delay.h"
#include "GPIO_Init_Configuration.h"
#include "control.h"

//-----------------------------------------------------------------
// 功能程序区
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// void PeripheralInit(void)
//-----------------------------------------------------------------
//
// 函数功能: 系统外设初始化
// 入口参数: 无
// 返 回 值: 无
// 注意事项: 无
//
//-----------------------------------------------------------------

extern u16 R_index;//声明数据角标

void PeripheralInit(void)
{
  u16 i;//定义循环变量

  GPIO_Init_Configuration(); // GPIO 初始化配置

  for (i = 1; i <= 100; i++)//初始化电位器，置0
  {
     Delay_1us(1);
     DOWN_024();
     DOWN_135();
  }

  R_index = 0;

  Set_USBClock();          // USB时钟设置
  USB_Interrupts_Config(); // USB中断初始化
  USB_Init();              // USB初始化
  Delay_5ms(100);

}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
